#include "protheus.ch"

/*****************************************************************************\
**---------------------------------------------------------------------------**
** FUNÇÃO   : AfterLogin  | AUTOR : Cristiano Machado  | DATA : 04/12/2015   **
**---------------------------------------------------------------------------**
** DESCRIÇÃO: Função Executada após Login no SIGAADV, no SIGAMDI só executa  **                                                    **
**         ** após acessar alguma rotina apartir do MENU.                    **
**---------------------------------------------------------------------------**
** USO      : Especifico para o cliente IMDEPA                               **
**---------------------------------------------------------------------------**
**---------------------------------------------------------------------------**
**            ATUALIZACOES SOFRIDAS DESDE A CONSTRUCAO INICIAL.              **
**---------------------------------------------------------------------------**
**   PROGRAMADOR   |   DATA   |            MOTIVO DA ALTERACAO               **
**---------------------------------------------------------------------------**
**                 |          |                                              **
**                 |          |                                              **
\*---------------------------------------------------------------------------*/
*******************************************************************************
User Function AfterLogin()
*******************************************************************************

Local cId		:= ParamIXB[1] //| Id de usuário que efetuou o Login... |
Local cNome 	:= ParamIXB[2]	//| Nome do usuário que efetuou Login... |


//| Define Teclas de Atalho
SetKey( K_CTRL_T, 		{ || U_ExecMyFunc() } ) //|  CONTROL + T |



Return()